# DXFExportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DXFExportOptions Constructor
DXFExportOptions Class See Also
---
Constructs a new instance of DXFImportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public DXFExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DXFExportOptions()
```

# See Also
DXFExportOptions Class
DXFExportOptions Overload
Autodesk.Revit.DB Namespace